Add new diagram to README. Improve the decsription
